# ---------------------------------------------функція input - бере у користувача дані, які нам потріні--------------------------------
#name = input("Enter your name: ")
#print(name) # виводимо на екран імя користувача 


#--------------------------------------------------------------------------------------------------------------------------------------
#---------------------------------------------- f - рядуки -----------------------------------------------------

# num_1 = 90
# num_2 = 87
# example = f'Simple example {num_1} + {num_2} = {num_1 + num_2}'
# print(example)

#-------------------------------------------------------------------------
# name = input('Enter your name: ')
# last_name = input('Enter your last name: ')
# full_name = f"Ваше ім'я {name} {last_name}"
# print(full_name)
#------------------------------------------------------------------------
# comments CTRL+SHIFT+/  (ctrl+fn+/)
#------------------------------------------------------------------------

#--------------------------------------- Типи даних --------------------
# num_1 = 1
# num_2 =1.8
# string_1 = '3'
# print(type(num_1), type(num_2), type(string_1)) #відображення типів даних. Класи можна між собою конвертувати один в один

# num_1 = str(1)
# num_2 = int(float(str(1.8))) #як з флоат зробити int
# string_1 = int('3')
# print(type(num_1), type(num_2), type(string_1))

# volume = float(input('Fuel volume')) #значення спочатку було срінгою, ми змінили його на значення з плаваючою крапкою
# price = float(input('Fuel price'))
# bill = f'Your bill {volume * price} uah'
# print(bill)
